# 1. На вход программе подается последовательность слов, каждое слово на отдельной
# строке.Концом последовательности является одно из трех слов:
# «стоп»,«хватит», «достаточно» (маленькими буквами, без кавычек). Напишите программу, которая выводит количество введенных слов

# a = []
# b = []
# while True:
#     a = input("введите слово - ")
#     b.append(a)
#     if a == "стоп" or  a == "хватит" or  a == "достаточно":
#         break
# print(b)
# print(len(b))

# n = 0
# while True:
#     a = input("введите слово - ")
#     n += 1
#     if a == "стоп" or  a == "хватит" or  a == "достаточно":
#         break
# print(len(a))