# 4.Представь, что мы пишем программу для банковских карточек. Человек может совершать покупки,
# пока у него на карте хватает на это денег.
#  В начале программы вводим количество денег, а потом вводим расходы, пока они не превышают баланс на карте.
# Когда превысили, мы должны получить, сколько успели сделать покупок и сколько осталось денег на карте.


# a = int(input("введите количество денег - "))
# i = 0
# while a >= 0:
#     d = int(input("введите расход денег - "))
#     i += 1
#     a = a - d
#     print("покука № -", i, "остаток денег =", a)
# else:
#     print("недостаточно средств", 'количество покупок -', i-1)