#Определить нарушение скорости
V = int(input("зафиксирована скорость "))
speed_limit = V > 90
B = 32
if speed_limit:
    print("нарушение скоростного режима")
    if 90+10 <= V < 90+20:
        print("штраф ", 1*B, "руб.")
    elif 90+20 <= V  < 90+30:
        print("штраф от", 1*B, "до", 3*B, "руб.")
    elif 90 + 30 <= V < 90 + 40:
        print("штраф от", 3*B, "до", 10*B, "руб.")
    elif 90 + 40 <= V:
        print("штраф от", 8*B, "до", 12*B, "руб.")
else:
    print("нарушений нет")